; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-5-3)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	s0 - location
	s1 - location
	s2 - location
	p0-1 - location
	p1-0 - location
	p1-2 - location
	p2-0 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s0)
	(at driver3 s0)
	(at truck1 s1)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s2)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s2)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s1)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s0)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at package1 s1)
	(at package2 s1)
	(at package3 s2)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 64)
	(= (time-to-drive s1 s0) 64)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 10)
	(= (time-to-drive s2 s0) 10)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 94)
	(= (time-to-drive s1 s2) 94)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s1)
	(at driver2 s0)
	(at driver3 s0)
	(at truck1 s0)
	(at truck2 s0)
	(at truck3 s2)
	(at truck4 s0)
	(at truck5 s0)
	(at package1 s1)
	(at package2 s1)
	(at package3 s1)
	))

(:metric minimize (+ (* 2 (total-time)) (* 4 (fuel-used))))

)

; plan
1. (walk driver2 s0 p0-1)
   deleted: (at driver2 s0)
   added: (at driver2 p0-1)
   goals met: 5 of 11
2. (load-truck package3 truck2 s2)
   deleted: (at package3 s2)
   added: (in package3 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 5 of 11
3. (walk driver2 p0-1 s1)
   deleted: (at driver2 p0-1)
   added: (at driver2 s1)
   goals met: 5 of 11
4. (board-truck driver2 truck4 s1)
   deleted: (at driver2 s1) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 5 of 11
5. (drive-truck truck4 s1 s0 driver2)
   deleted: (at truck4 s1)
   added: (at truck4 s0)
   changed: (fuel-used) from 0 to 640
   goals met: 6 of 11
6. (walk driver1 s2 p1-2)
   deleted: (at driver1 s2)
   added: (at driver1 p1-2)
   goals met: 6 of 11
7. (unload-truck package3 truck2 s2)
   deleted: (in package3 truck2)
   added: (at package3 s2)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 6 of 11
8. (walk driver1 p1-2 s1)
   deleted: (at driver1 p1-2)
   added: (at driver1 s1)
   goals met: 7 of 11
9. (board-truck driver1 truck1 s1)
   deleted: (at driver1 s1) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 6 of 11
10. (disembark-truck driver2 truck4 s0)
   deleted: (driving driver2 truck4)
   added: (at driver2 s0) (empty truck4)
   goals met: 7 of 11
11. (drive-truck truck1 s1 s2 driver1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   changed: (fuel-used) from 640 to 1580
   goals met: 7 of 11
12. (disembark-truck driver1 truck1 s2)
   deleted: (driving driver1 truck1)
   added: (at driver1 s2) (empty truck1)
   goals met: 7 of 11
13. (board-truck driver1 truck2 s2)
   deleted: (at driver1 s2) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 7 of 11
14. (load-truck package3 truck2 s2)
   deleted: (at package3 s2)
   added: (in package3 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 7 of 11
15. (drive-truck truck2 s2 s1 driver1)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   changed: (fuel-used) from 1580 to 2614
   goals met: 7 of 11
16. (disembark-truck driver1 truck2 s1)
   deleted: (driving driver1 truck2)
   added: (at driver1 s1) (empty truck2)
   goals met: 8 of 11
17. (walk driver1 s1 p1-2)
   deleted: (at driver1 s1)
   added: (at driver1 p1-2)
   goals met: 7 of 11
18. (walk driver1 p1-2 s2)
   deleted: (at driver1 p1-2)
   added: (at driver1 s2)
   goals met: 7 of 11
19. (walk driver2 s0 p0-1)
   deleted: (at driver2 s0)
   added: (at driver2 p0-1)
   goals met: 6 of 11
20. (walk driver2 p0-1 s1)
   deleted: (at driver2 p0-1)
   added: (at driver2 s1)
   goals met: 6 of 11
21. (board-truck driver2 truck2 s1)
   deleted: (at driver2 s1) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 6 of 11
22. (drive-truck truck2 s1 s0 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   changed: (fuel-used) from 2614 to 3318
   goals met: 7 of 11
23. (walk driver1 s2 p1-2)
   deleted: (at driver1 s2)
   added: (at driver1 p1-2)
   goals met: 7 of 11
24. (disembark-truck driver2 truck2 s0)
   deleted: (driving driver2 truck2)
   added: (at driver2 s0) (empty truck2)
   goals met: 8 of 11
25. (unload-truck package3 truck2 s0)
   deleted: (in package3 truck2)
   added: (at package3 s0)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 8 of 11
26. (load-truck package3 truck5 s0)
   deleted: (at package3 s0)
   added: (in package3 truck5)
   changed: (load truck5) from 0 to 1, (fuel-per-minute truck5) from 10 to 11
   goals met: 8 of 11
27. (walk driver1 p1-2 s1)
   deleted: (at driver1 p1-2)
   added: (at driver1 s1)
   goals met: 9 of 11
28. (board-truck driver2 truck4 s0)
   deleted: (at driver2 s0) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 8 of 11
29. (board-truck driver3 truck5 s0)
   deleted: (at driver3 s0) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 7 of 11
30. (drive-truck truck4 s0 s2 driver2)
   deleted: (at truck4 s0)
   added: (at truck4 s2)
   changed: (fuel-used) from 3318 to 3418
   goals met: 6 of 11
31. (drive-truck truck5 s0 s1 driver3)
   deleted: (at truck5 s0)
   added: (at truck5 s1)
   changed: (fuel-used) from 3418 to 4122
   goals met: 5 of 11
32. (unload-truck package3 truck5 s1)
   deleted: (in package3 truck5)
   added: (at package3 s1)
   changed: (load truck5) from 1 to 0, (fuel-per-minute truck5) from 11 to 10
   goals met: 6 of 11
33. (drive-truck truck5 s1 s0 driver3)
   deleted: (at truck5 s1)
   added: (at truck5 s0)
   changed: (fuel-used) from 4122 to 4762
   goals met: 7 of 11
34. (disembark-truck driver2 truck4 s2)
   deleted: (driving driver2 truck4)
   added: (at driver2 s2) (empty truck4)
   goals met: 7 of 11
35. (walk driver2 s2 p2-0)
   deleted: (at driver2 s2)
   added: (at driver2 p2-0)
   goals met: 7 of 11
36. (walk driver2 p2-0 s0)
   deleted: (at driver2 p2-0)
   added: (at driver2 s0)
   goals met: 8 of 11
37. (drive-truck truck5 s0 s2 driver3)
   deleted: (at truck5 s0)
   added: (at truck5 s2)
   changed: (fuel-used) from 4762 to 4862
   goals met: 7 of 11
38. (disembark-truck driver3 truck5 s2)
   deleted: (driving driver3 truck5)
   added: (at driver3 s2) (empty truck5)
   goals met: 7 of 11
39. (board-truck driver3 truck4 s2)
   deleted: (at driver3 s2) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 7 of 11
40. (drive-truck truck4 s2 s0 driver3)
   deleted: (at truck4 s2)
   added: (at truck4 s0)
   changed: (fuel-used) from 4862 to 4962
   goals met: 8 of 11
41. (walk driver1 s1 p1-2)
   deleted: (at driver1 s1)
   added: (at driver1 p1-2)
   goals met: 7 of 11
42. (walk driver1 p1-2 s2)
   deleted: (at driver1 p1-2)
   added: (at driver1 s2)
   goals met: 7 of 11
43. (board-truck driver1 truck1 s2)
   deleted: (at driver1 s2) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 7 of 11
44. (drive-truck truck1 s2 s1 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   changed: (fuel-used) from 4962 to 5902
   goals met: 7 of 11
45. (drive-truck truck4 s0 s2 driver3)
   deleted: (at truck4 s0)
   added: (at truck4 s2)
   changed: (fuel-used) from 5902 to 6002
   goals met: 6 of 11
46. (disembark-truck driver3 truck4 s2)
   deleted: (driving driver3 truck4)
   added: (at driver3 s2) (empty truck4)
   goals met: 6 of 11
47. (board-truck driver3 truck5 s2)
   deleted: (at driver3 s2) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 6 of 11
48. (drive-truck truck5 s2 s0 driver3)
   deleted: (at truck5 s2)
   added: (at truck5 s0)
   changed: (fuel-used) from 6002 to 6102
   goals met: 7 of 11
49. (disembark-truck driver3 truck5 s0)
   deleted: (driving driver3 truck5)
   added: (at driver3 s0) (empty truck5)
   goals met: 8 of 11
50. (disembark-truck driver1 truck1 s1)
   deleted: (driving driver1 truck1)
   added: (at driver1 s1) (empty truck1)
   goals met: 9 of 11
51. (walk driver1 s1 p1-2)
   deleted: (at driver1 s1)
   added: (at driver1 p1-2)
   goals met: 8 of 11
52. (walk driver1 p1-2 s2)
   deleted: (at driver1 p1-2)
   added: (at driver1 s2)
   goals met: 8 of 11
53. (walk driver2 s0 p0-1)
   deleted: (at driver2 s0)
   added: (at driver2 p0-1)
   goals met: 7 of 11
54. (walk driver1 s2 p1-2)
   deleted: (at driver1 s2)
   added: (at driver1 p1-2)
   goals met: 7 of 11
55. (walk driver2 p0-1 s1)
   deleted: (at driver2 p0-1)
   added: (at driver2 s1)
   goals met: 7 of 11
56. (board-truck driver2 truck1 s1)
   deleted: (at driver2 s1) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 7 of 11
57. (walk driver1 p1-2 s1)
   deleted: (at driver1 p1-2)
   added: (at driver1 s1)
   goals met: 8 of 11
58. (walk driver3 s0 p2-0)
   deleted: (at driver3 s0)
   added: (at driver3 p2-0)
   goals met: 7 of 11
59. (drive-truck truck1 s1 s0 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   changed: (fuel-used) from 6102 to 6742
   goals met: 8 of 11
60. (disembark-truck driver2 truck1 s0)
   deleted: (driving driver2 truck1)
   added: (at driver2 s0) (empty truck1)
   goals met: 9 of 11
61. (walk driver3 p2-0 s2)
   deleted: (at driver3 p2-0)
   added: (at driver3 s2)
   goals met: 9 of 11
62. (board-truck driver3 truck4 s2)
   deleted: (at driver3 s2) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 9 of 11
63. (drive-truck truck4 s2 s0 driver3)
   deleted: (at truck4 s2)
   added: (at truck4 s0)
   changed: (fuel-used) from 6742 to 6842
   goals met: 10 of 11
64. (disembark-truck driver3 truck4 s0)
   deleted: (driving driver3 truck4)
   added: (at driver3 s0) (empty truck4)
   goals met: 11 of 11
